
#include "DBase.h"

class CDTimeWatch
{
public:
	CDTimeWatch();
	CDTimeWatch( const CDTimeWatch& right );
	CDTimeWatch& operator = (  const CDTimeWatch& right );

	~CDTimeWatch();

	/************************************
		描述: 开始计时
	
		返回值:void
	
		参数列表:
	************************************/
	void Start();

	/************************************
		描述: 停止计时
	
		返回值:void
	
		参数列表:
	************************************/
	void Stop();

	/************************************
		描述: 重置计时
	
		返回值:void
	
		参数列表:
	************************************/
	void Reset();

	/************************************
		描述: 重新开始计时
	
		返回值:void
	
		参数列表:
	************************************/
	void Restart();

	/************************************
		描述: 返回至开始计时到停止计时间的时差，单位微秒
	
		返回值:INT64
	
		参数列表:
	************************************/
	INT64 Elapsed() const;

	/************************************
		描述: 返回秒级计时时间
	
		返回值:TIME32_S
	
		参数列表:
	************************************/
	TIME32_S ElapsedSeconds() const;

	/************************************
		描述: 返回毫秒级计时时间
	
		返回值:TIME64_MS
	
		参数列表:
	************************************/

	TIME64_MS ElapsedMillisconds() const;

		/************************************
		描述: 获取当前tickcount
		返回值：UINT64，单位微妙

		参数列表:
	************************************/
	static INT64 GetTickCount();

private:
	/**
	 * 是否运行中
	 */
	bool							m_bRunning;

	/**
	 * 开始时间戳， 精度微妙
	 */
	INT64							m_start;

	/**
	 * 计时值， 精度微妙
	 */
	INT64							m_elapsed;
};

